Revit 2027 API
ExternalServices.BuiltInExternalServices.PipeFrictionFactorService Property
 Pipe friction factor service id
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId PipeFrictionFactorService { get; }
Public Shared ReadOnly Property PipeFrictionFactorService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ PipeFrictionFactorService {
	ExternalServiceId^ get ();
}
static member PipeFrictionFactorService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace